profiling/stage_6/get_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 3.325ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.376ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.182ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 7.732ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.56ms    5.36ms  47.65ms   83.39%
    Req/Sec     2.57k     1.49k    8.27k    65.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.58ms
 75.000%    8.61ms
 90.000%   13.24ms
 99.000%   22.22ms
 99.900%   31.22ms
 99.990%   39.68ms
 99.999%   46.08ms
100.000%   47.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.186     0.000000            1         1.00
       0.806     0.100000        18626         1.11
       1.135     0.200000        37188         1.25
       1.472     0.300000        55753         1.43
       1.919     0.400000        74329         1.67
       3.579     0.500000        92880         2.00
       4.695     0.550000       102170         2.22
       5.643     0.600000       111466         2.50
       6.507     0.650000       120754         2.86
       7.447     0.700000       130021         3.33
       8.615     0.750000       139349         4.00
       9.247     0.775000       143979         4.44
       9.911     0.800000       148606         5.00
      10.639     0.825000       153231         5.71
      11.431     0.850000       157869         6.67
      12.279     0.875000       162521         8.00
      12.735     0.887500       164842         8.89
      13.239     0.900000       167157        10.00
      13.815     0.912500       169482        11.43
      14.463     0.925000       171815        13.33
      15.191     0.937500       174134        16.00
      15.583     0.943750       175295        17.78
      16.023     0.950000       176443        20.00
      16.559     0.956250       177631        22.86
      17.135     0.962500       178771        26.67
      17.775     0.968750       179925        32.00
      18.175     0.971875       180525        35.56
      18.543     0.975000       181087        40.00
      19.039     0.978125       181672        45.71
      19.663     0.981250       182251        53.33
      20.495     0.984375       182828        64.00
      20.895     0.985938       183121        71.11
      21.311     0.987500       183408        80.00
      21.839     0.989062       183700        91.43
      22.495     0.990625       183988       106.67
      23.311     0.992188       184281       128.00
      23.775     0.992969       184424       142.22
      24.303     0.993750       184572       160.00
      24.879     0.994531       184716       182.86
      25.519     0.995313       184862       213.33
      26.463     0.996094       185009       256.00
      27.055     0.996484       185076       284.44
      27.471     0.996875       185150       320.00
      27.903     0.997266       185220       365.71
      28.319     0.997656       185292       426.67
      28.879     0.998047       185365       512.00
      29.215     0.998242       185401       568.89
      29.503     0.998437       185437       640.00
      29.903     0.998633       185475       731.43
      30.431     0.998828       185512       853.33
      31.375     0.999023       185547      1024.00
      31.727     0.999121       185565      1137.78
      32.175     0.999219       185582      1280.00
      32.623     0.999316       185601      1462.86
      33.311     0.999414       185620      1706.67
      34.175     0.999512       185638      2048.00
      34.495     0.999561       185646      2275.56
      34.751     0.999609       185656      2560.00
      35.039     0.999658       185665      2925.71
      35.647     0.999707       185673      3413.33
      36.735     0.999756       185682      4096.00
      37.119     0.999780       185687      4551.11
      37.343     0.999805       185692      5120.00
      37.855     0.999829       185696      5851.43
      38.623     0.999854       185700      6826.67
      39.231     0.999878       185705      8192.00
      39.487     0.999890       185707      9102.22
      39.775     0.999902       185709     10240.00
      40.543     0.999915       185712     11702.86
      40.863     0.999927       185714     13653.33
      41.439     0.999939       185716     16384.00
      43.103     0.999945       185717     18204.44
      43.199     0.999951       185718     20480.00
      43.519     0.999957       185720     23405.71
      44.095     0.999963       185721     27306.67
      44.191     0.999969       185722     32768.00
      44.191     0.999973       185722     36408.89
      44.927     0.999976       185723     40960.00
      44.959     0.999979       185724     46811.43
      44.959     0.999982       185724     54613.33
      46.079     0.999985       185725     65536.00
      46.079     0.999986       185725     72817.78
      46.079     0.999988       185725     81920.00
      47.519     0.999989       185726     93622.86
      47.519     0.999991       185726    109226.67
      47.519     0.999992       185726    131072.00
      47.519     0.999993       185726    145635.56
      47.519     0.999994       185726    163840.00
      47.679     0.999995       185727    187245.71
      47.679     1.000000       185727          inf
#[Mean    =        5.559, StdDeviation   =        5.359]
#[Max     =       47.648, Total count    =       185727]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  290033 requests in 30.00s, 18.49MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
  Non-2xx or 3xx responses: 3
Requests/sec:   9666.54
Transfer/sec:    631.03KB