profiling/stage_6/put_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 13.257ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 10.726ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 14.856ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 10.488ms, rate sampling interval: 32ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.98ms    6.42ms  44.86ms   68.24%
    Req/Sec     2.53k     1.33k    6.26k    65.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.15ms
 75.000%   16.17ms
 90.000%   19.81ms
 99.000%   28.58ms
 99.900%   38.05ms
 99.990%   42.59ms
 99.999%   44.13ms
100.000%   44.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.201     0.000000            1         1.00
       2.387     0.100000        18588         1.11
       6.323     0.200000        37170         1.25
       8.663     0.300000        55762         1.43
      10.519     0.400000        74353         1.67
      12.151     0.500000        92918         2.00
      12.951     0.550000       102224         2.22
      13.759     0.600000       111554         2.50
      14.567     0.650000       120866         2.86
      15.343     0.700000       130093         3.33
      16.167     0.750000       139384         4.00
      16.607     0.775000       144140         4.44
      17.071     0.800000       148706         5.00
      17.599     0.825000       153306         5.71
      18.223     0.850000       158007         6.67
      18.927     0.875000       162652         8.00
      19.343     0.887500       164986         8.89
      19.807     0.900000       167302        10.00
      20.319     0.912500       169607        11.43
      20.895     0.925000       171889        13.33
      21.599     0.937500       174218        16.00
      21.999     0.943750       175411        17.78
      22.399     0.950000       176555        20.00
      22.847     0.956250       177714        22.86
      23.343     0.962500       178854        26.67
      23.951     0.968750       180017        32.00
      24.287     0.971875       180599        35.56
      24.751     0.975000       181176        40.00
      25.279     0.978125       181757        45.71
      25.887     0.981250       182334        53.33
      26.639     0.984375       182926        64.00
      27.119     0.985938       183210        71.11
      27.599     0.987500       183499        80.00
      28.207     0.989062       183792        91.43
      28.831     0.990625       184081       106.67
      29.551     0.992188       184367       128.00
      29.935     0.992969       184512       142.22
      30.319     0.993750       184658       160.00
      30.831     0.994531       184802       182.86
      31.503     0.995313       184950       213.33
      32.383     0.996094       185096       256.00
      32.831     0.996484       185165       284.44
      33.311     0.996875       185240       320.00
      33.759     0.997266       185314       365.71
      34.239     0.997656       185388       426.67
      34.751     0.998047       185458       512.00
      35.007     0.998242       185492       568.89
      35.263     0.998437       185529       640.00
      35.711     0.998633       185564       731.43
      37.343     0.998828       185601       853.33
      38.079     0.999023       185640      1024.00
      38.207     0.999121       185655      1137.78
      38.431     0.999219       185677      1280.00
      38.623     0.999316       185692      1462.86
      38.815     0.999414       185710      1706.67
      38.975     0.999512       185731      2048.00
      39.039     0.999561       185737      2275.56
      39.135     0.999609       185750      2560.00
      39.263     0.999658       185755      2925.71
      39.455     0.999707       185764      3413.33
      39.615     0.999756       185773      4096.00
      39.743     0.999780       185778      4551.11
      39.839     0.999805       185784      5120.00
      40.031     0.999829       185789      5851.43
      40.255     0.999854       185791      6826.67
      42.207     0.999878       185796      8192.00
      42.431     0.999890       185798      9102.22
      42.591     0.999902       185800     10240.00
      42.783     0.999915       185803     11702.86
      42.911     0.999927       185806     13653.33
      42.975     0.999939       185807     16384.00
      43.007     0.999945       185808     18204.44
      43.135     0.999951       185809     20480.00
      43.359     0.999957       185811     23405.71
      43.871     0.999963       185812     27306.67
      43.935     0.999969       185813     32768.00
      43.935     0.999973       185813     36408.89
      43.999     0.999976       185814     40960.00
      44.031     0.999979       185815     46811.43
      44.031     0.999982       185815     54613.33
      44.127     0.999985       185816     65536.00
      44.127     0.999986       185816     72817.78
      44.127     0.999988       185816     81920.00
      44.735     0.999989       185817     93622.86
      44.735     0.999991       185817    109226.67
      44.735     0.999992       185817    131072.00
      44.735     0.999993       185817    145635.56
      44.735     0.999994       185817    163840.00
      44.895     0.999995       185818    187245.71
      44.895     1.000000       185818          inf
#[Mean    =       11.977, StdDeviation   =        6.419]
#[Max     =       44.864, Total count    =       185818]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  287872 requests in 30.00s, 18.39MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
  Non-2xx or 3xx responses: 17
Requests/sec:   9595.78
Transfer/sec:    627.86KB